#ifndef FPGA_REG_H
#define FPGA_REG_H

#define FPGA_reg_num 128

typedef enum ZD4BU_2018_FPGAReg
{
    Adr_Reserved0,
    Adr_Test,        // 1 Р РµРіРёСЃС‚СЂ С‚РµСЃС‚РёСЂРѕРІР°РЅРёСЏ Р·Р°РїРёСЃРё / С‡С‚РµРЅРёСЏ РїРѕ USB
    Adr_Clr,         // 2 РЎР±СЂРѕСЃ СЃС‡РµС‚С‡РёРєРѕРІ Р°РґСЂРµСЃР°С†РёРё Р·Р°РїРёСЃРё С‚Р°Р±Р»РёС†
    Adr_Reserved3,
    Adr_Reserved4,
    Adr_Reserved5,
    Adr_Reserved6,
    Adr_Reserved7,
    Adr_Reserved8,
    Adr_Reserved9,
    Adr_Reserved10,
    Adr_Reserved11,
    Adr_Reserved12,
    Adr_Reserved13,
    Adr_Reserved14,
    Adr_Reserved15,
    Adr_Reserved16,
    Adr_Reserved17,
    Adr_Reserved18,
    Adr_Reserved19,
    Adr_PTrF,           // 20 Р§Р°СЃС‚РѕС‚Р° РёРјРїСѓР»СЊСЃР° РїРµСЂРµРґР°С‚С‡РёРєР° PW Doppler : 50 - 2MHz, 10 - 10MHz
    Adr_PTrN,           // 21 РЁРёСЂРёРЅР° РёРјРїСѓР»СЊСЃР° РїРµСЂРµРґР°С‚С‡РёРєР°(С‡РёСЃР»Рѕ РїРµСЂРёРѕРґРѕРІ)
    Adr_Reserved22,
    Adr_Reserved23,
    Adr_Reserved24,
    Adr_Reserved25,
    Adr_DopMode,		// 26 0 - PW РјРѕРґР° / 1 - CW РјРѕРґР°
    Adr_CWF,            // 27 Р§Р°СЃС‚РѕС‚Р° РёР·Р»СѓС‡РµРЅРёСЏ РїРµСЂРµРґР°С‚С‡РёРєР° CW Doppler : 0 - 4MHz; 1 - 8MHz
    Adr_CWChN,          // 28 Р’С‹Р±СЂР°РЅРЅС‹Р№ РєР°РЅР°Р» CW : 0, 1
    Adr_PDChN,      	// 29 Р’С‹Р±СЂР°РЅРЅС‹Р№ РєР°РЅР°Р» PW : 0, 1, 2, 3
    Adr_CWEn,           // 30 0 - РІС‹РєР»СЋС‡РµРЅРёРµ / 1 - РІРєР»СЋС‡РµРЅРёРµ РёР·Р»СѓС‡РµРЅРёСЏ CW
    Adr_PWTest,      	// 31   0 - РІ Р±СѓС„РµСЂ Р·Р°РїРёСЃС‹РІР°СЋС‚СЃСЏ СЂРµР°Р»СЊРЅС‹Рµ РґР°РЅРЅС‹Рµ СЃ РїСЂРёС‘РјРЅРёРєР°
                        //      1 - РІ Р±СѓС„РµСЂ РІРјРµСЃС‚Рѕ РґР°РЅРЅС‹С… Р·Р°РїРёСЃС‹РІР°СЋС‚СЃСЏ Р·РЅР°С‡РµРЅРёСЏ СЃС‡С‘С‚С‡РёРєР°
    Adr_PWCh,          	// 32   0 - РѕРґРЅРѕРєР°РЅР°Р»СЊРЅС‹Р№ PW СЂРµР¶РёРј
                        //      1 - РґРІСѓС…РєР°РЅР°Р»СЊРЅС‹Р№ PW СЂРµР¶РёРј
    Adr_CWTest,         // 33   0 - РІ Р±СѓС„РµСЂ Р·Р°РїРёСЃС‹РІР°СЋС‚СЃСЏ СЂРµР°Р»СЊРЅС‹Рµ РґР°РЅРЅС‹Рµ СЃ РїСЂРёС‘РјРЅРёРєР°
                        //      1 - РІ Р±СѓС„РµСЂ РІРјРµСЃС‚Рѕ РґР°РЅРЅС‹С… Р·Р°РїРёСЃС‹РІР°СЋС‚СЃСЏ Р·РЅР°С‡РµРЅРёСЏ СЃС‡С‘С‚С‡РёРєР°
    Adr_FirBPFilterTab, // 34   РІС…РѕРґРЅРѕР№ РїРѕР»РѕСЃРѕРІРѕР№ С„РёР»СЊС‚СЂ
    Adr_FirLPFilterTab, // 35	РІС‹С…РѕРґРЅРѕР№ Р°РЅС‚РёСЌР»Р°Р№Р·РёРЅРіРѕРІС‹Р№(РќР§) С„РёР»СЊС‚СЂ
    Adr_AdcSpiNum,      // 36   РљРѕР»Р»РёС‡РµСЃРІС‚Рѕ СЃР»РѕРІ, Р·Р°РіСЂСѓР¶Р°РµРјС‹С… РїРѕ SPI РІ AFE5809
    Adr_AdcSpiAddr,     // 37	РђРґСЂРµСЃ СЂРµРіРёСЃС‚СЂР° РІ AFE5809, РєСѓРґР° С…РѕС‚РёРј РѕС‚РїСЂР°РІРёС‚СЊ РёР»Рё РїСЂРѕС‡РёС‚Р°С‚СЊ РґР°РЅРЅС‹Рµ
    Adr_AdcSpiData,		// 38	Р”Р°РЅРЅС‹Рµ, РєРѕС‚РѕСЂС‹Рµ С…РѕС‚РёРј Р·Р°РїРёСЃР°С‚СЊ РІ AFE5809
    Adr_AdcReset,		// 39	РџСЂРѕРіСЂР°РјРЅС‹Р№ СЃР±СЂРѕСЃ AFE5809
    Adr_InterpRatio,    // 40   РљРѕСЌС„С„РёС†РёРµРЅС‚ РёРЅС‚РµСЂРїРѕР»СЏС†РёРё РґР»СЏ CIC С„РёР»СЊС‚СЂР°
    Adr_AdcPwsMode,		// 41   Р­РЅРµСЂРіРѕСЃР±РµСЂРµР¶РµРЅРёРµ AFE5809 0 - NORMAL, 0x0001 - PDN_GBL, 0x0002 - PDN_ADC, 0x0004 - PDN VCA
    Adr_ADCch_PW21,     // 42	0..7: РІС‹Р±РѕСЂ 1 РёР· 8 РєР°РЅР°Р»РѕРІ РђР¦Рџ РґР»СЏ РїРµСЂРІРѕРіРѕ РєР°РЅР»Р° PW СЂРµР¶РёРјР°
    Adr_SetPower,       // 43	РЈРїСЂР°РІР»РµРЅРёРµ РЅР°РїСЂСЏР¶РµРЅРёРµРј РїРёС‚Р°РЅРёСЏ РїРµСЂРµРґР°С‚С‡РёРєР°(+РјР°СЃРєР° 0x8000 - PW, 0x4000 - CW; РєРѕРґ - Р±РёС‚С‹ 11..0)
    Adr_TGC,			// 44	С‚Р°Р±Р»РёС†Р° TGC
    Adr_ADCch_PW22,		// 45   0..7: РІС‹Р±РѕСЂ 1 РёР· 8 РєР°РЅР°Р»РѕРІ РђР¦Рџ РґР»СЏ РІС‚РѕСЂРѕРіРѕ РєР°РЅР»Р° PW СЂРµР¶РёРјР°
    Adr_ADCch_PW10,     // 46	0..7: РІС‹Р±РѕСЂ 1 РёР· 8 РєР°РЅР°Р»РѕРІ РђР¦Рџ РґР»СЏ С‚СЂРµС‚СЊРµРіРѕ РєР°РЅР»Р° PW СЂРµР¶РёРјР°
    Adr_DPeriod,        // 47	Р”Р»РёС‚РµР»СЊРЅРѕСЃС‚СЊ СЃС‚СЂРѕРєРё(РѕРїСЂРµРґРµР»СЏРµС‚ PRF - РїРµСЂРёРѕРґ РїРѕРІС‚РѕСЂРµРЅРёСЏ Р·РѕРЅРґРёСЂРѕРІР°РЅРёР№) (*20ns)
    Adr_Reserved48,
    Adr_Reserved49,
    Adr_Start_Delay,    // 50   Р—Р°РґРµСЂР¶РєР° РјРµР¶РґСѓ РїРѕР»СѓС‡РµРЅРёРµРј РєРѕРјР°РЅРґС‹ "СЃС‚Р°СЂС‚" Рё СЃС‚Р°СЂС‚РѕРј РєРѕРјР°РЅРґРѕР°РїРїР°СЂР°С‚Р° *1.3 РјСЃ
    Adr_Reserved51,
    Adr_Reserved52,
    Adr_Reserved53,
    Adr_Reserved54,
    Adr_Start_CA,       // 55   РЈРїСЂР°РІР»РµРЅРёРµ РєРѕРјР°РЅРґРѕР°РїРїР°СЂР°С‚РѕРј(РљРђ) :
                        // 0x0000 - РѕСЃС‚Р°РЅРѕРІ, 0x0001 - РЅРµРїСЂРµСЂС‹РІРЅРѕ(СЃ РїРµСЂРёРѕРґРѕРј Adr_DPeriod), 0x0002 РёР»Рё 0x0003 - РѕРґРЅРѕРєСЂР°С‚РЅРѕ
    Adr_Reserved56,
    Adr_Reserved57,
    Adr_BufSizeD,       // 58	РљРѕР»РёС‡РµСЃС‚РІРѕ РѕС‚СЃС‡РµС‚РѕРІ, Р·Р°РїРёСЃС‹РІР°РµРјС‹С… РІ Р±СѓС„РµСЂ РґР°РЅРЅС‹С…, Р‘Р•Р— С…РёРґРµСЂР°. (РѕС‚СЃС‡РµС‚С‹ СЃР»РµРґСѓСЋС‚ РїР°СЂР°РјРё С‡РµСЂРµР· 1 us)
    Adr_DataStartD,     // 59   РќР°С‡Р°Р»Рѕ "РѕРєРЅР°" РІРІРѕРґР° РґР°РЅРЅС‹С…(*20ns)
    Adr_DBufReset,		// 60	РЎР±СЂРѕСЃ Р±СѓС„РµСЂР° РґР°РЅРЅС‹С… РґР»СЏ РѕР±РјРµРЅР° СЃ FT600
    Adr_AbortPipe,		// 61	РЎР±СЂРѕСЃ Р±СѓС„РµСЂР° РґР°РЅРЅС‹С… Рё Р·Р°РІРµСЂС€РµРЅРёРµ СЃРµСЃСЃРёРё(Р·Р°РїРёСЃСЊ Р±Р°Р№С‚Р° РµСЃР»Рё РІРёСЃРёС‚ TXE)
    Adr_Reserved62,
    Adr_Reserved63,
    Adr_Reserved64,
    Adr_Reserved65,
    Adr_Reserved66,
    Adr_Reserved67,
    Adr_Reserved68,
    Adr_GetInfo,        // 69	Р§С‚РµРЅРёРµ Р±Р»РѕРєР° РїР°СЂР°РјРµС‚СЂРѕРІ(8 СЃР»РѕРІ, С‚Рµ Р¶Рµ, С‡С‚Рѕ РІ С…РёРґРµСЂР°С… СЃС‚СЂРѕРє)
    Adr_SimFreq,        // 70   Р§Р°СЃС‚РѕС‚Р° СЃРёРіРЅР°Р»Р° РЅР° РІС‹С…РѕРґРµ СЏРґСЂР° DDS
    Adr_SimAmpl,        // 71   РђРјРїР»РёС‚СѓРґР° СЃРёРіРЅР°Р»Р° РЅР° РІС‹С…РѕРґРµ СЏРґСЂР° DDS
    Adr_SimMode,        // 72   0x0000 - РґР»СЏ РѕС‚Р»Р°РґРєРё: РёРјРёС‚Р°С‚РѕСЂ СЃРёРЅСѓСЃР° РіРµРЅРµСЂРёСЂСѓРµС‚ РЅРµРїСЂРµСЂС‹РІРЅС‹Р№ СЃРёРіРЅР°Р» РїРѕ РІСЃРµРј РіР»СѓР±РёРЅР°Рј
                        //      0x0001 - РґР»СЏ РѕС‚Р»Р°РґРєРё: РёРјРёС‚Р°С‚РѕСЂ СЃРёРЅСѓСЃР° РіРµРЅРµСЂРёСЂСѓРµС‚ СЃРёРіРЅР°Р» С‚РѕР»СЊРєРѕ СЃ Р·Р°РґР°РЅРЅРѕР№ РіР»СѓР±РёРЅС‹
    Adr_SimStDepth,     // 73   РќР°С‡Р°Р»СЊРЅР°СЏ РіР»СѓР±РёРЅР° РґР»СЏ Adr_SimMode = 1
    Adr_SimEndDepth,    // 74   РљРѕРЅРµС‡РЅР°СЏ РіР»СѓР±РёРЅР° РґР»СЏ Adr_SimMode = 1
    Adr_SimEn,          // 75   0x0000 - РЅР° РІС…РѕРґ С†РёС„СЂРѕРІРѕРіРѕ РїСЂРёС‘РјРЅРёРєР° РїРѕСЃС‚СѓРїР°СЋС‚ СЂРµР°Р»СЊРЅС‹Рµ РґР°РЅРЅС‹Рµ СЃ РђР¦Рџ
                        //      0x0001 - РґР»СЏ РѕС‚Р»Р°РґРєРё: РЅР° РІС…РѕРґ С†РёС„СЂРѕРІРѕРіРѕ РїСЂРёС‘РјРЅРёРєР° РїРѕСЃС‚СѓРїР°СЋС‚ РґР°РЅРЅС‹Рµ СЃ РёРјРёС‚Р°С‚РѕСЂР° СЃРёРЅСѓСЃР°
    Adr_Reserved76,
    Adr_Reserved77,
    Adr_Reserved78,
    Adr_PWPlayDiscBit,  // 79  РљРѕР»РёС‡РµСЃС‚РІРѕ РѕС‚Р±СЂР°СЃС‹РІР°РµРјС‹С… Р±РёС‚ РїРѕСЃР»Рµ СЃСѓРјРјРёСЂРѕРІР°РЅРёСЏ РІ PW - СЂРµР¶РёРјРµ
    Adr_PWPlayStDepth,  // 80  РќР°С‡Р°Р»СЊРЅР°СЏ РіР»СѓР±РёРЅР° РёР·РјРµСЂРёС‚РµР»СЊРЅРѕРіРѕ РѕР±СЉС‘РјР°
    Adr_PWPlayEndDepth, // 81  РљРѕРЅРµС‡РЅР°СЏ РіР»СѓР±РёРЅР° РёР·РјРµСЂРёС‚РµР»СЊРЅРѕРіРѕ РѕР±СЉС‘РјР°
    Adr_Reserved82,
    Adr_Reserved83,
    Adr_Reserved84,
    Adr_Reserved85,
    Adr_Reserved86,
    Adr_Reserved87,
    Adr_Reserved88,
    Adr_Reserved89,
    Adr_Reserved90,
    Adr_Reserved91,
    Adr_Reserved92,
    Adr_Reserved93,
    Adr_Reserved94,
    Adr_Reserved95,
    Adr_Reserved96,
    Adr_Reserved97,
    Adr_Reserved98,
    Adr_Reserved99,
    Adr_Reserved100,
    Adr_Reserved101,
    Adr_Reserved102,
    Adr_Reserved103,
    Adr_Reserved104,
    Adr_Reserved105,
    Adr_Reserved106,
    Adr_Reserved107,
    Adr_Reserved108,
    Adr_Reserved109,
    Adr_Reserved110,
    Adr_Reserved111,
    Adr_Reserved112,
    Adr_Reserved113,
    Adr_Reserved114,
    Adr_Reserved115,
    Adr_Reserved116,
    Adr_DataCtrl,   // 117          0x0000 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ СЃ РІС‹С…РѕРґР° РґРµС†РёРјР°С‚РѕСЂР°
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0001 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ СЃ РІС‹С…РѕРґР° РђР¦Рџ
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0002 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ СЃ РІС‹С…РѕРґР° РїРѕР»РѕСЃРѕРІРѕРіРѕ С„РёР»СЊС‚СЂР°
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0003 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ Real СЃ РІС‹С…РѕРґР° РјРѕРґСѓР»СЏС‚РѕСЂР°
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0004 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ Imag СЃ РІС‹С…РѕРґР° РјРѕРґСѓР»СЏС‚РѕСЂР°
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0005 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ Real СЃ РІС‹С…РѕРґР° Р¤РќР§
                    // РґР»СЏ РѕС‚Р»Р°РґРєРё: 0x0006 - РІ USB РѕС‚РїСЂР°РІР»СЏСЋС‚СЃСЏ РґР°РЅРЅС‹Рµ Imag СЃ РІС‹С…РѕРґР° Р¤РќР§
    Adr_Reserved118,
    Adr_Reserved119,
    Adr_Reserved120,
    Adr_Reserved121,
    Adr_CODPlayMult,   // 122 СѓРјРЅРѕР¶Р°СЋС‰РёР№ РєРѕСЌС„С„РёС†РёРµРЅС‚ РїРµСЂРµРґ РѕС‚РїСЂР°РІРєРѕР№ РґР°РЅРЅС‹С… РІ РєРѕРґРµРє
    Adr_CODReset,   // 123 СЃР±СЂРѕСЃ РєРѕРґРµРєР° TLV320AIC3254
    Adr_CODSpiData,	// 124 СЂРµРіРёСЃС‚СЂ РґР°РЅРЅС‹С… РґР»СЏ РєРѕРґРµРєР° TLV320AIC3254

    //РЈРїСЂР°РІР»РµРЅРёРµ РєРѕРЅС‚СЂРѕР»Р»РµСЂРѕРј РёРЅС‚РµСЂС„РµР№СЃР° 1-Wire
    Adr_1WireFIFO,	// 125  Р РµРіРёСЃС‚СЂ fifo РґР»СЏ Р·Р°РіСЂСѓР·РєРё РґР°РЅРЅС‹С… РІ СѓСЃС‚СЂРѕР№СЃС‚РІРѕ 1-WIRE
    Adr_1WireSel,	// 126  Р РµРіРёСЃС‚СЂ РІС‹Р±РѕСЂР° С‚РµРєСѓС‰РµРіРѕ РєРѕРЅС‚СЂРѕР»Р»РµСЂР° 1-WIRE
    Adr_Reserved127
} ZD4BU_2018_FPGAReg;

#endif // ZD4BU_2018_FPGAREG_H
